---
kind: method
id: M:Autodesk.Revit.DB.ForgeTypeId.GetHashCode
source: html/1d1a018e-d28f-a4bd-f793-f483a1eb2e44.htm
---
# Autodesk.Revit.DB.ForgeTypeId.GetHashCode Method

Returns the hash code for this ForgeTypeId

## Syntax (C#)
```csharp
public override int GetHashCode()
```

## Returns
A 32-bit signed integer hash code.